app/controllers/school_classes_controller.rb

    def create
        school_class = SchoolClass.new(school_class_params)
        school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "cis"], ["room_number", 22], ["created_at", "2020-08-26 03:14:54.365971"], ["updated_at", "2020-08-26 03:14:54.365971"]]

    def update
        # byebug
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "CIS"], ["room_number", 220], ["updated_at", "2020-08-26 15:24:54.316956"], ["id", 8]]